Tekla.Structures.Analysis.AnalysisPosition
The AnalysisPosition class contains information related to analysis positions.

Tekla.Structures.Analysis.AnalysisPosition._NodeID
The node of the position.

Tekla.Structures.Analysis.AnalysisPosition._Node
The node of the position.

Tekla.Structures.Analysis.AnalysisPosition._Type
The type of the position.

Tekla.Structures.Analysis.AnalysisPosition.Node
The node of the position.

Tekla.Structures.Analysis.AnalysisPosition.Type
The type of the position.

Tekla.Structures.Analysis.AnalysisPosition.Insert
Inserts an analysis position.
AnalysisModelName has to be set
ID = Node ID
Analysis object type has to be set:
ANALYSIS_POSITION_BAR
FatherObjectID = PartId
FatherObject2ID = BarId
ANALYSIS_POSITION_AREA
FatherObjectID = PartId
FatherObject2ID = AreaId
ANALYSIS_POSITION_AREA_HOLE
FatherObjectID = AreaId
FatherObject2ID = HoleIndex (0..)
ANALYSIS_POSITION_AREA_INNER
FatherObjectID = PartId
FatherObject2ID = AreaId
ANALYSIS_POSITION_EDGE_SPLIT
FatherObjectID = AreaId
FatherObject2ID = EdgeIndex (0..)
ANALYSIS_POSITION_EDGE_SPLIT_HOLE
FatherObjectID = AreaId
FatherObject2ID = 1000 * HoleIndex (0..) + EdgeIndex

Tekla.Structures.Analysis.AnalysisPosition.Move(Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Vector)
Move analysis position.
partId: The part ID.
move: The move.
Returns: True if successful.

Tekla.Structures.Analysis.AnalysisPosition.Select
Selects an analysis position.

Tekla.Structures.Analysis.AnalysisPosition.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPosition.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPosition.CollectData
Collects additional data.

Tekla.Structures.Analysis.AnalysisPosition.MoveInstance(Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Vector)
DO NOT USE! For internal usage only!